# bot_token = '5888370892:AAFHeniFsqU_Lz2m66XFaURzfh54zVkNl3Y'
BOT_TOKEN = '1846983248:AAFWEawI9T02ANqUYvXhkSZPKTmgyyJgEeI'#джарвис
API_ID = 23252815
API_HASH = '1c7cc8946281556985f5fdb4e735a0f1'
MY_CHAT_ID = 1622588506
ADMIN_ID = MY_CHAT_ID
MODERATOR_LINK = '@Akwinchester'
MY_TABLE = '1AB1ZG-64PckVxstAtyDy7tBiApsSrbv6x1cmfznRA9I'
ID_TABLE = MY_TABLE
RANGE_FOR_GOOGLE_TABLE = 'Лист1!A1'


HEADLINES_FOR_TABLE = ['Фамилия Имя', 'Номер', 'ники', 'название к/п', 'видео']

BUTTON_TEXT = {
    'one_button': 'Да, поехали 🚀',
    'two_button':'Мы собрали команду. Что делать дальше?',
    'three_button': 'Ага, мы придумали продукт. Что с ним делать?',
    'four_button': 'А что нужно знать перед съёмкой?',
    'five_button': 'В каком формате и как отправлять видео?',
    'six_button': 'А когда посмотрим другие работы и узнаем победителей?',
    'block_button_1':'Еще раз про сроки',
    'block_button_2':'Еще раз про формат видео',
    'block_button_3':'Готовы загрузить видео',
    'block_button_4':'Нужна помощь',
}

MESSAGE_TEXT ={
    'start': '''Привет. Мы рады, что ты хочешь поучаствовать в командном конкурсе.
Давай начнем с того, что мы пришлем тебе правила участия?''',
    'one_step': '''1️⃣ Собери команду из коллег от 2 до 10 человек, с которыми тебя объединяют общие ценности и интересы. Вы можете работать в разных отделах, главное, чтобы вам было комфортно вместе.''',
    'two_step': '''2️⃣ Придумайте идеальный для вашей команды продукт или товар, который мог бы выпускать Самокат. Он может быть фантастическим – например, универсальное молоко, которое по желанию превращается в кефир или гель для душа, который меняет запах в течение дня. Главное – чтобы он не противоречил нашим ценностям. Помни, что мы не продаем алкоголь, табачные и прочие вредные для организма изделия.''',
    'three_step': '''3️⃣ Снимите видеопрезентацию длительностью до 2,5 минут вместе с командой. Сделайте прототип упаковки продукта: это может быть фотошоп, изделие из картона или просто нарисованный от руки шедевр. Ответьте в видео на следующие вопросы о продукте: 
Как он называется? 
Что это такое?
Какие проблемы вашей команды он решает? 
Почему вы его придумали? 
Почему он может пригодиться и другим людям? 
''',
    'four_step': '''4️⃣ Рассказывать о продукте в видео может один человек или вся команда. Перед съёмкой проверь, достаточно ли в памяти места для видео, заряжен ли аккумулятор. Если снимаешь на телефон, поставь его в авиарежим, чтобы ничто не отвлекало. А ещё протри камеру – так изображение будет чётким и ярким. 

❗ Помни, мы не будем засчитывать работы, где есть оскорбления, жестокость, пошлость или нецензурная лексика. Знаем, что ты это и так понимаешь, но на всякий случай закрепим.
''',
    'five_step':'''5️⃣ Выберите одного человека, который отправит видео нам со своего аккаунта в Телеграме. Мы свяжемся с ним для связи в случае выигрыша. 1 команда — 1 видео. 

⌛ Отправьте видео в бот до 11:00 23 января по московскому времени. 

🔦 Форматы: AVI;  MOV; MP4. 

Если ты хочешь использовать в видео музыку, мы рекомендуем использовать музыкальные файлы, “очищенные” от авторских прав.Тогда мы точно можем быть уверены, что видео загрузится и YouTube его не заблокирует. Чтобы найти в интернете такие треки, используй запрос “Музыка без авторских прав”.
''',
    'six_step':'''Из всех претендентов, мы выберем 10 работ с самыми оригинальными идеями и самыми креативными решениями. Голосование за победителя пройдет на ютуб-канале Просвет с 26 по 29 января, а уже 31 января подведём итоги и объявим результаты в наших внутренних каналах. Лучшие команды получат призы! 

Удачи! Уже ждём ваши видео! 💫
''',
    'block_button_1':'''⌛ Видео нужно загрузить в бот до 11:00 23 января по московскому времени. 
С 26 по 29 января мы проведем голосование в ХХ ссылка, а 31 января подведём итоги. Лучшие команды получат заслуженные призы.
''',
    'block_button_2':'''🔦 Форматы: AVI;  MOV; MP4.
    ''',
    'block_button_3': '''Ура, кажется ты готов поделиться видео с нами! Но перед тем, как я приму его у тебя, мне надо узнать о тебе и твоей команде чуточку больше. 
Напиши свои фамилию и имя''',
    'block_button_4': f'''Чтобы задать вопрос, перейдите в чат с модератором — {MODERATOR_LINK}
    ''',
    'get_phone_number': '''Приятно познакомиться! Пожалуйста, оставь твой контактный номер телефона, по которому мои коллеги смогут связаться с тобой и твоей командой в случае победы в конкурсе. Напиши свой номер в формате: +7(xxx)xxxxxxx
''',
    'get_nick_teammate': '''Отлично, напиши ники в Телеграмм и фамилии и имя участников твоей команды в формате: 
Имя Фамилия - @ник
Имя Фамилия - @ник
Имя Фамилия - @ник и так далее
Подсказка: Чтобы тебе было удобней, напиши их сначала себе в заметки или сообщения, а затем скопируй и вставь сюда.
''',
    'get_name_team_product': '''Отлично! Теперь мне нужно название твоей команды и название продукта, который вы презентуете. Напиши его в формате: “Название команды — название продукта”. Например, Команда Велосипед — гель для душа “Под настроение”
''',
    'get_video': '''Ну и последнее — загружай видео. Просто прикрепи его в сообщении и отправь мне. Не сомневайся, я сохраню его и оно обязательно окажется где надо!)''',
    'finish_collection_data': '''Молодец всё выполнено! Поздравляю, теперь ты и твоя команда  — полноправный участник этого конкурса! ⭐
Напоминаю, что голосование пройдет на внутреннем ютуб-канале Просвет с 26 по 29 января, а уже 31 января мы узнаем три команды-победителя. 
В случае, если твоя команда победит, с тобой свяжется команда марафона и уточнит информацию о том, как получить подарки.
А пока — присоединяйтесь всей командой к Телеграм-каналу Марафона Ценностей  ССЫЛКА, следите там за новостями, принимайте активное участие в Марафоне на платформе ССЫЛКА. 
''',





}