# bot_token = '5888370892:AAFHeniFsqU_Lz2m66XFaURzfh54zVkNl3Y'
BOT_TOKEN = '5581848649:AAG86ST-z7sGJ1d1R8zfIa1mU3tV08wZFKg'
BOT_TOKEN = '1846983248:AAFWEawI9T02ANqUYvXhkSZPKTmgyyJgEeI'
API_ID = 23252815
API_HASH = '1c7cc8946281556985f5fdb4e735a0f1'
MY_CHAT_ID = 1622588506
ADMIN_ID = MY_CHAT_ID
MODERATOR_LINK = '@Akwinchester'
MY_TABLE = '1AB1ZG-64PckVxstAtyDy7tBiApsSrbv6x1cmfznRA9I'
ID_TABLE = MY_TABLE
RANGE_FOR_GOOGLE_TABLE = 'Лист1!A1'
ID_FOLDER = '1HjVbYHB4p66Ln_S0MCgHj840rHB8Grza'
PATH_LOCAL_FOLDER = './files/'

HEADLINES_FOR_TABLE = ['Фамилия Имя', 'Номер', 'ники', 'название к/п', 'видео', 'еще что-то']

BUTTON_TEXT = {
    'one_button': 'Да, поехали 🚀',
    'two_button':'Мы собрали команду. Что делать дальше? ▶',
    'three_button': 'Ага, мы придумали продукт. Что с ним делать? ▶',
    'four_button': 'А что нужно знать перед съёмкой? ⏩',
    'five_button': 'В каком формате и как отправлять видео? ⭐',
    'six_button': 'А когда посмотрим другие работы и узнаем победителей? ⚡',
    'block_button_1':'Ещё раз про сроки 🗓️',
    'block_button_2':'Ещё раз про формат видео 🎬',
    'block_button_3':'Готовы загрузить видео 📼',
    'block_button_4':'Нужна помощь❓',
    'block_button_5':'Отменить загрузку видео',
}

MESSAGE_TEXT ={
    'start': '''Привет. Мы рады, что ты хочешь поучаствовать в командном конкурсе.
    
Давай начнём с того, что мы пришлём тебе правила участия?
''',
    'one_step': '''1️⃣ Собери команду из коллег от 2 до 10 человек, с которыми тебя объединяют общие ценности и интересы. 

Вы можете работать в разных отделах, главное, чтобы вам было комфортно вместе.
''',
    'two_step': '''2️⃣ Придумайте идеальный для вашей команды продукт или товар, который мог бы выпускать Самокат. 

Он может быть фантастическим — например, универсальное молоко, которое по желанию превращается в кефир, или гель для душа, меняющий запах в течение дня. Главное — чтобы он не противоречил нашим ценностям. 

❗Помни, что мы не продаём алкоголь, табачные и прочие вредные для организма изделия.
''',
    'three_step': '''3️⃣ Снимите видеопрезентацию длительностью до 2,5 минут вместе с командой. 

Сделайте прототип упаковки продукта: это может быть иллюстрация, созданная в фотошопе, изделие из картона или просто нарисованный от руки шедевр. 

Ответьте в видео на следующие вопросы о продукте: 
•	Как он называется?
•	Что это такое?
•	Какие проблемы вашей команды он решает?
•	Почему вы его придумали?
•	Почему он может пригодиться и другим людям?
''',
    'four_step': '''4️⃣ Рассказывать о продукте в видео может один человек или вся команда.

Перед съёмкой проверь, достаточно ли в памяти устройства места для видео, заряжен ли аккумулятор. Если снимаешь на телефон, поставь его в авиарежим, чтобы ничто не отвлекало. А ещё протри камеру — так изображение будет чётким и ярким. 

❗Помни: мы не будем засчитывать работы, где есть оскорбления, жестокость, пошлость или нецензурная лексика. Знаем, что ты это и так понимаешь, но на всякий случай закрепим.
''',
    'five_step':'''5️⃣ Выберите одного человека, который отправит видео нам со своего аккаунта в Телеграме. Мы свяжемся с ним для связи в случае выигрыша. 

Одна команда — одно видео. 

⌛ Отправьте видео в бот до 23 января, 11:00 по московскому времени. 

🔦 Форматы: AVI; MOV; MP4. 

🎶 Если ты хочешь добавить в видео музыку, мы рекомендуем использовать музыкальные файлы, свободные от авторских прав. Тогда видео точно загрузится и YouTube его не заблокирует. Чтобы найти в интернете такие треки, используй запрос «Музыка без авторских прав».
''',
    'six_step':'''🏆 Из всех претендентов мы выберем 10 работ с самыми оригинальными идеями и креативными решениями. 

Голосование за победителей пройдёт на YouTube-канале <a href="https://www.youtube.com/@pro_6730/">«Просвет»</a> с 26 по 29 января, а уже 31 января мы подведём итоги и объявим результаты в наших внутренних каналах. 


Лучшие команды получат мерч Самоката и увлекательные настольные игры 🎁
Ждём ваши крутейшие видео 💫
Удачи! 🤗''',
    'block_button_1':'''⌛ Видео нужно загрузить в бот до 23 января до 11:00 по московскому времени.
    
🚀С 26 по 29 января мы проведём голосование на YouTube-канале <a href="https://www.youtube.com/@pro_6730/">«Просвет»</a>, а 31 января подведём итоги. 

😎Лучшие команды получат мерч Самоката и увлекательные настольные игры.
''',
    'block_button_2':'''🔦 Форматы: AVI; MOV; MP4.''',
    'block_button_3': ''' Ура, кажется, ты готов поделиться видео с нами 📹

Но перед тем как я его приму, мне нужно узнать о тебе и твоей команде чуточку больше. 

Напиши свои фамилию и имя.
''',
    'block_button_4': f'''Чтобы задать вопрос, перейдите в чат с модератором — {MODERATOR_LINK}
    ''',
    'get_phone_number': ''' Приятно познакомиться 🤝

Пожалуйста, оставь свой контактный номер телефона, по которому мои коллеги смогут связаться с тобой и твоей командой в случае победы в конкурсе. 

Напиши свой номер телефона в формате +7********** 📱
''',
    'get_nick_teammate': '''Спасибо! 

Теперь расскажи об участниках твоей команды: напиши их имена, фамилии и ники в Телеграме в формате: 
Имя Фамилия — @ник
Имя Фамилия — @ник
Имя Фамилия — @ник и так далее

Подсказка: чтобы тебе было удобнее, напиши их сначала себе в заметки или сообщения, а затем скопируй и вставь сюда.
''',
    'get_name_team_product': '''У тебя классная компания 💪🏻

Теперь я хотел бы узнать название твоей команды и продукта, который вы презентуете.

Напиши их в формате: «Название команды — название продукта». Например, «Команда “Велосипед” — гель для душа “Под настроение”».
''',
    'get_video': ''' Ну и последнее: загрузи видео в формате AVI, MOV или MP4. 

Просто прикрепи файл в сообщении и отправь мне 😊
''',
    'finish_collection_data': '''Молодец, всё выполнено ✅

Поздравляю, теперь ты и твоя команда — полноправные участники этого конкурса ⭐

⌛Напоминаю, что голосование пройдёт на внутреннем YouTube-канале <a href="https://www.youtube.com/@pro_6730/">«Просвет»</a> с 26 по 29 января, а уже 31 января мы узнаем три команды-победителя. 

🔸Если твоя команда победит, с тобой свяжется команда марафона и уточнит информацию для вручения подарков 🎁

👉 А пока — присоединяйтесь к Телеграм-каналу Марафона ценностей <a href="https://t.me/samokat_5_0">«Марафон ценностей»</a>, следите там за новостями» и принимайте активное участие в Марафоне на платформе <a href="https://t.me/samokat_5_0">«Марафон ценностей»</a>. ''',
    'now_pattern_phone':'''Введите номер в формате +7xxxxxxxxxx''',
    'exit_data_collection':'''Чтобы загрузить видео, нажмите кнопку "Готовы загрузить видео 📼" ''',
    'photo':'Загрузи видео в формате AVI, MOV или MP4.'


}
